# Core
brew "git"
brew "stow"
brew "curl"
brew "wget"
brew "make"
brew "gcc"

# Terminal
brew "ghostty"

# Editor
brew "neovim", args: ["HEAD"]

# Multiplexer
brew "tmux"

# Dev tools
brew "tree-sitter"
brew "lazygit"
brew "pyenv"
brew "pyenv-virtualenv"
brew "nvm"

# Nerd Font
cask "font-jetbrains-mono-nerd-font"
