# Core
brew "git"
brew "stow"
brew "curl"
brew "wget"
brew "make"
brew "gcc"

# Terminal
brew "ghostty"

# Editor
brew "neovim", args: ["HEAD"]

# Multiplexer
brew "tmux"

# Dev tools
brew "tree-sitter"
brew "lazygit"
brew "pyenv"
brew "pyenv-virtualenv"
brew "nvm"

# MCP servers
tap "dmtrKovalenko/fff"
brew "fff-mcp"

# Modern CLI
brew "starship"
brew "zoxide"
brew "atuin"
brew "fzf"
brew "eza"
brew "bat"

# Nerd Font
cask "font-jetbrains-mono-nerd-font"
